monsantoDocs/Product-booking-response.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header/>
	<soapenv:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<ag:outboundData xmlns:ag="urn:aggateway:names:ws:docexchange">
			<ag:processStep>ProductBookingWSResponse</ag:processStep>
			<ag:messageId/>
			<ag:xmlPayload>
				<urn:ProductBookingResponse xmlns:urn="urn:cidx:names:specification:ces:schema:all:5:3" Version="5.3">
					<urn:Header>
						<urn:ThisDocumentIdentifier>
							<urn:DocumentIdentifier>LGel4oRIxtUVXwufb8Uk9A==</urn:DocumentIdentifier>
						</urn:ThisDocumentIdentifier>
						<urn:ThisDocumentDateTime>
							<urn:DateTime DateTimeQualifier="On">2019-06-03T12:15:30Z</urn:DateTime>
						</urn:ThisDocumentDateTime>
						<urn:From>
							<urn:PartnerInformation>
								<urn:PartnerName>MONSANTO AGRICULTURAL CO</urn:PartnerName>
								<urn:PartnerIdentifier Agency="AGIIS-EBID">0062668030000</urn:PartnerIdentifier>
							</urn:PartnerInformation>
						</urn:From>
						<urn:To>
							<urn:PartnerInformation>
								<urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
								<urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
							</urn:PartnerInformation>
						</urn:To>
					</urn:Header>
					<urn:ProductBookingResponseBody>
						<urn:ProductBookingResponseProperties>
							<!-- Same as request-->
							<urn:ProductBookingType>Changed</urn:ProductBookingType>
							<urn:ProductBookingOrderNumber>1000</urn:ProductBookingOrderNumber>
							<urn:ProductBookingOrderTypeCode Domain="ANSI-ASC-X12-92">KN</urn:ProductBookingOrderTypeCode>
							<urn:ProductBookingOrderIssuedDate>
								<urn:DateTime DateTimeQualifier="On">2019-06-28T15:36:17Z</urn:DateTime>
							</urn:ProductBookingOrderIssuedDate>
							<urn:LanguageCode Domain="ISO-639-2T">EN</urn:LanguageCode>
							<urn:CurrencyCode Domain="ISO-4217">USD</urn:CurrencyCode>
							<urn:BuyerSequenceNumber>00000000</urn:BuyerSequenceNumber>
							<urn:SoftwareInformation>
								<urn:SoftwareSource>WS-XML</urn:SoftwareSource>
								<urn:SoftwareVersion>1.0.0</urn:SoftwareVersion>
							</urn:SoftwareInformation>
							<urn:ReferenceInformation ReferenceType="SalesOrderReference">
								<urn:DocumentReference>
									<!-- Keep this identifier to edit this just creted product booking order-->
									<urn:DocumentIdentifier>0611583652</urn:DocumentIdentifier>
								</urn:DocumentReference>
							</urn:ReferenceInformation>
						</urn:ProductBookingResponseProperties>
						<!--Same as request-->
						<urn:ProductBookingResponsePartners>
							<urn:Buyer>
								<urn:PartnerInformation>
									<urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
									<urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
									<urn:AddressInformation>
										<urn:AddressLine>74971 AVENUE 358</urn:AddressLine>
										<urn:CityName>WALLACE</urn:CityName>
										<urn:StateOrProvince>NE</urn:StateOrProvince>
										<urn:PostalCode>69169</urn:PostalCode>
										<urn:PostalCountry>US</urn:PostalCountry>
									</urn:AddressInformation>
								</urn:PartnerInformation>
							</urn:Buyer>
							<urn:Seller>
								<urn:PartnerInformation>
									<urn:PartnerName>MONSANTO AGRICULTURAL CO</urn:PartnerName>
									<urn:PartnerIdentifier Agency="AGIIS-EBID">0062668030000</urn:PartnerIdentifier>
								</urn:PartnerInformation>
							</urn:Seller>
							<urn:ShipTo>
								<urn:PartnerInformation>
									<urn:PartnerName> BOYD GIGAX</urn:PartnerName>
									<urn:PartnerIdentifier Agency="GLN">1100031728863</urn:PartnerIdentifier>
									<urn:AddressInformation>
										<urn:AddressLine>73523 AVENUE 358A</urn:AddressLine>
										<urn:CityName>HAYES CENTER</urn:CityName>
										<urn:StateOrProvince>NE</urn:StateOrProvince>
										<urn:PostalCode>69032</urn:PostalCode>
										<urn:PostalCountry>US</urn:PostalCountry>
									</urn:AddressInformation>
								</urn:PartnerInformation>
							</urn:ShipTo>
							<urn:SoldTo>
								<urn:PartnerInformation>
									<urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
									<urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
									<urn:AddressInformation>
										<urn:AddressLine>74971 AVENUE 358</urn:AddressLine>
										<urn:CityName>WALLACE</urn:CityName>
										<urn:StateOrProvince>NE</urn:StateOrProvince>
										<urn:PostalCode>69169</urn:PostalCode>
										<urn:PostalCountry>US</urn:PostalCountry>
									</urn:AddressInformation>
								</urn:PartnerInformation>
							</urn:SoldTo>
							<urn:Payer>
								<urn:PartnerInformation>
									<urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
									<urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
								</urn:PartnerInformation>
							</urn:Payer>
						</urn:ProductBookingResponsePartners>

						<urn:ProductBookingResponseDetails>
							<urn:ProductBookingResponseProductLineItem>
								<!-- LINE NUMBER GENERATED BY MONSANTO-->
								<urn:LineNumber>000010</urn:LineNumber>
								<urn:LineItemType>Sale</urn:LineItemType>
								<!-- LINE NUMBER GENERATED BY US-->
								<urn:ProductBookingOrderLineItemNumber>000001</urn:ProductBookingOrderLineItemNumber>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00883580763448</urn:ProductIdentifier>
								</urn:ProductIdentification>
								<urn:ReferenceInformation ReferenceType="ContractNumber">
									<urn:DocumentReference>
										<urn:DocumentIdentifier>1</urn:DocumentIdentifier>
									</urn:DocumentReference>
								</urn:ReferenceInformation>
								<urn:ProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>50.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">UN</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:ProductQuantity>
								<urn:PotentialShipDateTime>
									<urn:DateTimeInformation>
										<urn:DateTime DateTimeQualifier="On">2019-06-03T00:00:00Z</urn:DateTime>
									</urn:DateTimeInformation>
								</urn:PotentialShipDateTime>
							</urn:ProductBookingResponseProductLineItem>
							<urn:ProductBookingResponseProductLineItem>
								<urn:LineNumber>000020</urn:LineNumber>
								<urn:LineItemType>Sale</urn:LineItemType>
								<urn:ProductBookingOrderLineItemNumber>000004</urn:ProductBookingOrderLineItemNumber>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00888346313967</urn:ProductIdentifier>
								</urn:ProductIdentification>
								<urn:ReferenceInformation ReferenceType="ContractNumber">
									<urn:DocumentReference>
										<urn:DocumentIdentifier>1</urn:DocumentIdentifier>
									</urn:DocumentReference>
								</urn:ReferenceInformation>
								<urn:ProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>25.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:ProductQuantity>
								<urn:PotentialShipDateTime>
									<urn:DateTimeInformation>
										<urn:DateTime DateTimeQualifier="On">2019-06-03T00:00:00Z</urn:DateTime>
									</urn:DateTimeInformation>
								</urn:PotentialShipDateTime>
							</urn:ProductBookingResponseProductLineItem>
							<urn:ProductBookingResponseProductLineItem>
								<urn:LineNumber>000030</urn:LineNumber>
								<urn:LineItemType>Sale</urn:LineItemType>
								<urn:ProductBookingOrderLineItemNumber>000005</urn:ProductBookingOrderLineItemNumber>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00883580952880</urn:ProductIdentifier>
								</urn:ProductIdentification>
								<urn:ReferenceInformation ReferenceType="ContractNumber">
									<urn:DocumentReference>
										<urn:DocumentIdentifier>1</urn:DocumentIdentifier>
									</urn:DocumentReference>
								</urn:ReferenceInformation>
								<urn:ProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>10.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:ProductQuantity>
								<urn:PotentialShipDateTime>
									<urn:DateTimeInformation>
										<urn:DateTime DateTimeQualifier="On">2019-06-03T00:00:00Z</urn:DateTime>
									</urn:DateTimeInformation>
								</urn:PotentialShipDateTime>
							</urn:ProductBookingResponseProductLineItem>
						</urn:ProductBookingResponseDetails>
						<urn:RetailerOrderImpactSummary>
							<urn:RetailerResponseSummaryProductLineItem>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00883580763448</urn:ProductIdentifier>
									<urn:ProductName>DKC53-56RIB AR SS SP50 BAS500</urn:ProductName>
								</urn:ProductIdentification>
								<urn:IncreaseDecreaseRetailerProductQuantity>
									<urn:IncreaseOrDecreaseType>Increase</urn:IncreaseOrDecreaseType>
									<urn:Measurement>
										<urn:MeasurementValue>0</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">UN</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:IncreaseDecreaseRetailerProductQuantity>
								<urn:TotalRetailerOrderedProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue/>
										<urn:UnitOfMeasureCode Domain=""/>
									</urn:Measurement>
								</urn:TotalRetailerOrderedProductQuantity>
								<urn:TotalBookingDemandQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>50.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">UN</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalBookingDemandQuantity>
								<urn:TotalLongShortPosition>
									<urn:LongShortPositionType>Short</urn:LongShortPositionType>
									<urn:Measurement>
										<urn:MeasurementValue>-50.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">UN</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalLongShortPosition>
							</urn:RetailerResponseSummaryProductLineItem>
							<urn:RetailerResponseSummaryProductLineItem>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00888346313967</urn:ProductIdentifier>
									<urn:ProductName>DKC62-20RIB AF VT2P 80M BAS250 B</urn:ProductName>
								</urn:ProductIdentification>
								<urn:IncreaseDecreaseRetailerProductQuantity>
									<urn:IncreaseOrDecreaseType>Increase</urn:IncreaseOrDecreaseType>
									<urn:Measurement>
										<urn:MeasurementValue>0</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:IncreaseDecreaseRetailerProductQuantity>
								<urn:TotalRetailerOrderedProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue/>
										<urn:UnitOfMeasureCode Domain=""/>
									</urn:Measurement>
								</urn:TotalRetailerOrderedProductQuantity>
								<urn:TotalBookingDemandQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>25.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalBookingDemandQuantity>
								<urn:TotalLongShortPosition>
									<urn:LongShortPositionType>Short</urn:LongShortPositionType>
									<urn:Measurement>
										<urn:MeasurementValue>-25.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalLongShortPosition>
							</urn:RetailerResponseSummaryProductLineItem>
							<urn:RetailerResponseSummaryProductLineItem>
								<urn:ProductIdentification>
									<urn:ProductIdentifier Agency="AGIIS-ProductID">00883580952880</urn:ProductIdentifier>
									<urn:ProductName>DKC55-20RIB AR SS 80M BAS500</urn:ProductName>
								</urn:ProductIdentification>
								<urn:IncreaseDecreaseRetailerProductQuantity>
									<urn:IncreaseOrDecreaseType>Increase</urn:IncreaseOrDecreaseType>
									<urn:Measurement>
										<urn:MeasurementValue>10.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:IncreaseDecreaseRetailerProductQuantity>
								<urn:TotalRetailerOrderedProductQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>10.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalRetailerOrderedProductQuantity>
								<urn:TotalBookingDemandQuantity>
									<urn:Measurement>
										<urn:MeasurementValue>10.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalBookingDemandQuantity>
								<urn:TotalLongShortPosition>
									<urn:LongShortPositionType>Zero</urn:LongShortPositionType>
									<urn:Measurement>
										<urn:MeasurementValue>0.000</urn:MeasurementValue>
										<urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
									</urn:Measurement>
								</urn:TotalLongShortPosition>
							</urn:RetailerResponseSummaryProductLineItem>
						</urn:RetailerOrderImpactSummary>
					</urn:ProductBookingResponseBody>
				</urn:ProductBookingResponse>
			</ag:xmlPayload>
		</ag:outboundData>
	</soapenv:Body>
</soapenv:Envelope>
